In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

print("all set up ðŸ˜Ž")

all set up ðŸ˜Ž

<h2>Filter and Data Selection</h2>

In [3]:
my_obj = Series(np.arange(8), index=["row 1", "row 2","row 3","row 4","row 5","row 6","row 7","row 8" ])
my_obj

row 1    0
row 2    1
row 3    2
row 4    3
row 5    4
row 6    5
row 7    6
row 8    7
dtype: int64

In [4]:
my_obj["row 8"]

7

In [5]:
myFrame = DataFrame(np.random.rand(36).reshape((6,6)), index=['row 1','row 2','row 3','row 4','row 5','row 6'])
myFrame

              0         1         2         3         4         5
row 1  0.405220  0.536895  0.950817  0.941841  0.082228  0.613092
row 2  0.615682  0.160376  0.537773  0.393984  0.406422  0.770676
row 3  0.576352  0.782210  0.513624  0.800574  0.652861  0.240727
row 4  0.144011  0.640050  0.296746  0.990107  0.994831  0.029446
row 5  0.192845  0.093640  0.755983  0.962629  0.482479  0.168316
row 6  0.892963  0.890430  0.434581  0.598102  0.453818  0.124902

In [6]:
### Data Slicing
my_obj["row 3": "row 6"]

row 3    2
row 4    3
row 5    4
row 6    5
dtype: int64

In [7]:
### comparing with scalars
myFrame < .2

           0      1      2      3      4      5
row 1  False  False  False  False   True  False
row 2  False   True  False  False  False  False
row 3  False  False  False  False  False  False
row 4   True  False  False  False  False   True
row 5   True   True  False  False  False   True
row 6  False  False  False  False  False   True

In [8]:
### Filtering with scalars
my_obj[my_obj > 6] # give me all rows that have a value greater than 6

row 8    7
dtype: int64

In [9]:
### setting values with scalars 
my_obj['row 1', 'row 5', 'row 8'] = 8
my_obj

row 1    8
row 2    1
row 3    2
row 4    3
row 5    8
row 6    5
row 7    6
row 8    8
dtype: int64

<h2>Treating Missing Values</h2>

In [10]:
### figuring out what data is missing
missing = np.nan
series_obj = Series(["row 1", "row 2", missing, "row 3", "row 4", "row 5", "row 6", missing, "row 8"])
series_obj

0    row 1
1    row 2
2      NaN
3    row 3
4    row 4
5    row 5
6    row 6
7      NaN
8    row 8
dtype: object

In [11]:
### using isNull method to return a series of boolen values to determine 
###which values are null (true) and whch are available (false)

series_obj.isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7     True
8    False
dtype: bool

In [12]:
### Filling in for missing values
np.random.seed(25)
df_obj = DataFrame(np.random.randn(36).reshape(6,6))
df_obj.iloc[3:5, 0] = missing
df_obj.iloc[1:4, 5] = missing
df_obj

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734       NaN
2  2.152957 -1.334661  0.076380 -1.246089  1.202272       NaN
3       NaN -0.419678  2.294842 -2.594487  2.822756       NaN
4       NaN -1.976254  0.533340 -0.290870 -0.513520  1.982626
5  0.226001 -1.839905  1.607671  0.388292  0.399732  0.405477

In [43]:
### fillna finds all values that are missing and fills in with whatever values you provide
fill_df = df_obj.fillna(0)
fill_df

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734  0.000000
2  2.152957 -1.334661  0.076380 -1.246089  1.202272  0.000000
3  0.000000 -0.419678  2.294842 -2.594487  2.822756  0.000000
4  0.000000 -1.976254  0.533340 -0.290870 -0.513520  1.982626
5  0.226001 -1.839905  1.607671  0.388292  0.399732  0.405477

In [44]:
### to fill in each columns values with their own unique value you can pass a 
### dictionary into the method
fill_df = df_obj.fillna({0:99999, 5:99999 })
fill_df

              0         1         2         3         4             5
0      0.228273  1.026890 -0.839585 -0.591182 -0.956888     -0.222326
1     -0.619915  1.837905 -2.053231  0.868583 -0.920734  99999.000000
2      2.152957 -1.334661  0.076380 -1.246089  1.202272  99999.000000
3  99999.000000 -0.419678  2.294842 -2.594487  2.822756  99999.000000
4  99999.000000 -1.976254  0.533340 -0.290870 -0.513520      1.982626
5      0.226001 -1.839905  1.607671  0.388292  0.399732      0.405477

In [46]:
###using fill forward method fills in missing data with the previous value encountered
fill_df = df_obj.fillna(method="ffill")
fill_df

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
1 -0.619915  1.837905 -2.053231  0.868583 -0.920734 -0.222326
2  2.152957 -1.334661  0.076380 -1.246089  1.202272 -0.222326
3  2.152957 -0.419678  2.294842 -2.594487  2.822756 -0.222326
4  2.152957 -1.976254  0.533340 -0.290870 -0.513520  1.982626
5  0.226001 -1.839905  1.607671  0.388292  0.399732  0.405477

In [47]:
### filtering out or dropping all missing values
### To specify drop by columns instead of rows (which is the defualt) pass 
### the "axis" paramter and set it equal to 1.
### Passing the parameter "how" and setting it equal to "all" will only drop rows where ALL 
### values in the row are missing.
df_no_nan = df_obj.dropna()
df_no_nan

          0         1         2         3         4         5
0  0.228273  1.026890 -0.839585 -0.591182 -0.956888 -0.222326
5  0.226001 -1.839905  1.607671  0.388292  0.399732  0.405477

<h2>Removing Duplicates</h2>

In [56]:
my_df = DataFrame({'column1':[1,1,1,2,2,2,3,3,3], 'column2':['a','a','a','b','b','b','c','c','c'], 'column3':['A','A','A','B','B','B','C','C','C']})
my_df

   column1 column2 column3
0        1       a       A
1        1       a       A
2        1       a       A
3        2       b       B
4        2       b       B
5        2       b       B
6        3       c       C
7        3       c       C
8        3       c       C

In [58]:
###duplicted method searches each row in a dataframe for duplicates of another row
###found earlier
my_df.duplicated()

0    False
1     True
2     True
3    False
4     True
5     True
6    False
7     True
8     True
dtype: bool

In [59]:
### drop_duplicates
### can drop duplicates based off columns as well

my_df.drop_duplicates()

   column1 column2 column3
0        1       a       A
3        2       b       B
6        3       c       C

<h2>Transforming and Concatinating</h2>

In [63]:
df_obj1 = DataFrame(np.arange(36).reshape(6,6))
df_obj2 = DataFrame(np.arange(36).reshape(6,6))
df_obj1

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [64]:
df_obj2

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [66]:
joined_Data = pd.concat([df_obj1, df_obj2], axis=1)
joined_Data

    0   1   2   3   4   5   0   1   2   3   4   5
0   0   1   2   3   4   5   0   1   2   3   4   5
1   6   7   8   9  10  11   6   7   8   9  10  11
2  12  13  14  15  16  17  12  13  14  15  16  17
3  18  19  20  21  22  23  18  19  20  21  22  23
4  24  25  26  27  28  29  24  25  26  27  28  29
5  30  31  32  33  34  35  30  31  32  33  34  35

In [70]:
series_obj = Series(np.arange(6))
series_obj.name = "variable_added"
series_obj

0    0
1    1
2    2
3    3
4    4
5    5
Name: variable_added, dtype: int64

In [71]:
variable_added = DataFrame.join(joined_Data, series_obj)
variable_added

    0   1   2   3   4   5   0   1   2   3   4   5  variable_added
0   0   1   2   3   4   5   0   1   2   3   4   5               0
1   6   7   8   9  10  11   6   7   8   9  10  11               1
2  12  13  14  15  16  17  12  13  14  15  16  17               2
3  18  19  20  21  22  23  18  19  20  21  22  23               3
4  24  25  26  27  28  29  24  25  26  27  28  29               4
5  30  31  32  33  34  35  30  31  32  33  34  35               5

In [73]:
### can also add data using the append method to add data to the end of a set
variable_added.append([variable_added], ignore_index=True)

     0   1   2   3   4   5   0   1   2   3   4   5  variable_added
0    0   1   2   3   4   5   0   1   2   3   4   5               0
1    6   7   8   9  10  11   6   7   8   9  10  11               1
2   12  13  14  15  16  17  12  13  14  15  16  17               2
3   18  19  20  21  22  23  18  19  20  21  22  23               3
4   24  25  26  27  28  29  24  25  26  27  28  29               4
5   30  31  32  33  34  35  30  31  32  33  34  35               5
6    0   1   2   3   4   5   0   1   2   3   4   5               0
7    6   7   8   9  10  11   6   7   8   9  10  11               1
8   12  13  14  15  16  17  12  13  14  15  16  17               2
9   18  19  20  21  22  23  18  19  20  21  22  23               3
10  24  25  26  27  28  29  24  25  26  27  28  29               4
11  30  31  32  33  34  35  30  31  32  33  34  35               5

In [82]:
### sort data
df_obj2.sort_values(by=[2])

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35